{"backend": "tensorflow", "keras_version": "2.1.6", "config": {"output_layers": [["y_pred", 0, 0], ["event_out", 0, 0]], "name": "model_91", "layers": [{"name": "input_91", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20533], "sparse": false, "name": "input_91", "dtype": "float32"}, "inbound_nodes": []}, {"name": "dense_181", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_181", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 1.0000000116860974e-07}, "class_name": "L1L2"}, "bias_regularizer": null}, "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"name": "dense_182", "class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_182", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "use_bias": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_181", 0, 0, {}]]]}, {"name": "y_pred", "class_name": "Dense", "config": {"bias_constraint": null, "name": "y_pred", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "units": 9, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_182", 0, 0, {}]]]}, {"name": "event_out", "class_name": "Dense", "config": {"bias_constraint": null, "name": "event_out", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["dense_182", 0, 0, {}]]]}], "input_layers": [["input_91", 0, 0]]}, "class_name": "Model"}