{"config": {"input_layers": [["input_91", 0, 0]], "name": "model_91", "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 20533], "sparse": false, "name": "input_91", "dtype": "float32"}, "name": "input_91", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 32, "name": "dense_91", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "dense_91", "class_name": "Dense"}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 16, "name": "layer1", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "layer1", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 9, "name": "y_pred", "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "y_pred", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "name": "event_out", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "name": "event_out", "class_name": "Dense"}]}, "keras_version": "2.1.6", "class_name": "Model", "backend": "tensorflow"}