{"class_name": "Model", "keras_version": "2.1.6", "backend": "tensorflow", "config": {"input_layers": [["input_91", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_91", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 20533], "name": "input_91"}}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "name": "dense_91", "class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 32, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 1.0000000116860974e-07}}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_91"}}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "name": "layer1", "class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 16, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "layer1"}}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "name": "y_pred", "class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 9, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "y_pred"}}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "name": "event_out", "class_name": "Dense", "config": {"activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "event_out"}}], "name": "model_91", "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}}