{"keras_version": "2.1.6", "config": {"input_layers": [["input_91", 0, 0]], "name": "model_91", "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 20533], "dtype": "float32", "name": "input_91", "sparse": false}, "name": "input_91", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 32, "trainable": true, "name": "dense_91", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 16, "trainable": true, "name": "layer1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "units": 9, "trainable": true, "name": "y_pred", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "units": 1, "trainable": true, "name": "event_out", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Model"}