{"class_name": "Model", "keras_version": "2.1.6", "backend": "tensorflow", "config": {"output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "input_layers": [["input_91", 0, 0]], "name": "model_91", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_91", "config": {"batch_input_shape": [null, 20533], "dtype": "float32", "name": "input_91", "sparse": false}}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense", "name": "dense_91", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 1.0000000116860974e-07}}, "name": "dense_91", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 32, "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense", "name": "layer1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "name": "layer1", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 16, "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "name": "y_pred", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "name": "y_pred", "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 9, "kernel_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "name": "event_out", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_regularizer": null, "name": "event_out", "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "kernel_constraint": null, "activity_regularizer": null}}]}}