{"keras_version": "2.1.6", "class_name": "Model", "config": {"output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "name": "model_91", "input_layers": [["input_91", 0, 0]], "layers": [{"name": "input_91", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_91", "batch_input_shape": [null, 20533], "sparse": false}}, {"name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "name": "dense_91", "kernel_constraint": null, "trainable": true, "activation": "relu"}}, {"name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "name": "layer1", "kernel_constraint": null, "trainable": true, "activation": "relu"}}, {"name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "name": "y_pred", "kernel_constraint": null, "trainable": true, "activation": "softmax"}}, {"name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "name": "event_out", "kernel_constraint": null, "trainable": true, "activation": "linear"}}]}, "backend": "tensorflow"}