{"config": {"name": "model_91", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 20533], "sparse": false, "name": "input_91"}, "class_name": "InputLayer", "name": "input_91", "inbound_nodes": []}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_91", "kernel_constraint": null, "bias_regularizer": null, "units": 32, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense", "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "layer1", "kernel_constraint": null, "bias_regularizer": null, "units": 16, "kernel_regularizer": null}, "class_name": "Dense", "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"config": {"activation": "softmax", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "y_pred", "kernel_constraint": null, "bias_regularizer": null, "units": 9, "kernel_regularizer": null}, "class_name": "Dense", "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"config": {"activation": "linear", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "event_out", "kernel_constraint": null, "bias_regularizer": null, "units": 1, "kernel_regularizer": null}, "class_name": "Dense", "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]]}], "input_layers": [["input_91", 0, 0]], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.6"}