{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"name": "input_91", "batch_input_shape": [null, 20533], "dtype": "float32", "sparse": false}, "name": "input_91", "inbound_nodes": []}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "dense_91", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 32, "use_bias": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}}, "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "layer1", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "units": 16, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "y_pred", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 9, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "event_out", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]]}], "name": "model_91", "input_layers": [["input_91", 0, 0]], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}