{"class_name": "Model", "config": {"name": "model_91", "input_layers": [["input_91", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 20533], "name": "input_91"}, "inbound_nodes": [], "name": "input_91"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "kernel_constraint": null, "name": "dense_91", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}}, "inbound_nodes": [[["input_91", 0, 0, {}]]], "name": "dense_91"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_constraint": null, "name": "layer1", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["dense_91", 0, 0, {}]]], "name": "layer1"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9, "kernel_constraint": null, "name": "y_pred", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]], "name": "y_pred"}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_constraint": null, "name": "event_out", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]], "name": "event_out"}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}