{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_91", "input_layers": [["input_91", 0, 0]], "layers": [{"name": "input_91", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_91", "batch_input_shape": [null, 20533]}, "inbound_nodes": []}, {"name": "dense_91", "class_name": "Dense", "config": {"name": "dense_91", "units": 32, "activation": "relu", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "units": 16, "activation": "relu", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"name": "y_pred", "class_name": "Dense", "config": {"name": "y_pred", "units": 9, "activation": "softmax", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"name": "event_out", "class_name": "Dense", "config": {"name": "event_out", "units": 1, "activation": "linear", "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]]}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "keras_version": "2.1.6"}