{"backend": "tensorflow", "config": {"output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "layers": [{"name": "input_91", "config": {"dtype": "float32", "sparse": false, "name": "input_91", "batch_input_shape": [null, 20533]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dense_91", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_91", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"name": "layer1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "layer1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"name": "y_pred", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "y_pred", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 9, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"name": "event_out", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "event_out", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["layer1", 0, 0, {}]]]}], "name": "model_91", "input_layers": [["input_91", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.6"}