{"config": {"output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "name": "model_91", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 20533], "name": "input_91", "dtype": "float32"}, "name": "input_91", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "dense_91", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 1.0000000116860974e-07}, "class_name": "L1L2"}, "activation": "relu"}, "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "layer1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "kernel_regularizer": null, "activation": "relu"}, "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "y_pred", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 9, "kernel_regularizer": null, "activation": "softmax"}, "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "name": "event_out", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null, "activation": "linear"}, "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_91", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Model"}