{"config": {"name": "model_91", "layers": [{"name": "input_91", "config": {"sparse": false, "name": "input_91", "batch_input_shape": [null, 20533], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_91", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "activation": "relu", "name": "dense_91"}, "inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense"}, {"name": "layer1", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "name": "layer1"}, "inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense"}, {"name": "y_pred", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 9, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "name": "y_pred"}, "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "event_out", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "event_out"}, "inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense"}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "input_layers": [["input_91", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Model"}