{"class_name": "Model", "keras_version": "2.1.6", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 20533], "name": "input_91", "dtype": "float32"}, "name": "input_91"}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_91", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "relu", "units": 32}, "name": "dense_91"}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "layer1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "relu", "units": 16}, "name": "layer1"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "y_pred", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "softmax", "units": 9}, "name": "y_pred"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "event_out", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "linear", "units": 1}, "name": "event_out"}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "name": "model_91", "input_layers": [["input_91", 0, 0]]}, "backend": "tensorflow"}