{"keras_version": "2.1.6", "config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 20533], "name": "input_91"}, "name": "input_91", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "units": 32, "bias_constraint": null, "name": "dense_91", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_91", "class_name": "Dense"}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "units": 16, "bias_constraint": null, "name": "layer1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "layer1", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "units": 9, "bias_constraint": null, "name": "y_pred", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "y_pred", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "units": 1, "bias_constraint": null, "name": "event_out", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "event_out", "class_name": "Dense"}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "name": "model_91", "input_layers": [["input_91", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}