{"keras_version": "2.1.6", "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 20533], "sparse": false, "name": "input_91"}, "name": "input_91", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_91", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "name": "dense_91", "activation": "relu", "kernel_regularizer": {"config": {"l1": 1.0000000116860974e-07, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 32, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null}, "name": "dense_91", "class_name": "Dense"}, {"inbound_nodes": [[["dense_91", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "name": "layer1", "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 16, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null}, "name": "layer1", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "name": "y_pred", "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 9, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null}, "name": "y_pred", "class_name": "Dense"}, {"inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": true, "name": "event_out", "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "bias_constraint": null}, "name": "event_out", "class_name": "Dense"}], "name": "model_91", "input_layers": [["input_91", 0, 0]], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}