{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.6", "config": {"name": "model_91", "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]], "input_layers": [["input_91", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_91", "inbound_nodes": [], "config": {"sparse": false, "name": "input_91", "dtype": "float32", "batch_input_shape": [null, 20533]}}, {"class_name": "Dense", "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]], "config": {"name": "dense_91", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 32}}, {"class_name": "Dense", "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]], "config": {"name": "layer1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 16}}, {"class_name": "Dense", "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"name": "y_pred", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 9}}, {"class_name": "Dense", "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]], "config": {"name": "event_out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 1}}]}}