{"class_name": "Model", "config": {"input_layers": [["input_91", 0, 0]], "name": "model_91", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_91", "batch_input_shape": [null, 20533]}, "name": "input_91", "inbound_nodes": []}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 32, "name": "dense_91", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0000000116860974e-07, "l2": 0.0}}}, "name": "dense_91", "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 16, "name": "layer1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null}, "name": "layer1", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 9, "name": "y_pred", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null}, "name": "y_pred", "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "name": "event_out", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null}, "name": "event_out", "inbound_nodes": [[["layer1", 0, 0, {}]]]}], "output_layers": [["y_pred", 0, 0], ["event_out", 0, 0], ["layer1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6"}